# Задание 1 и задание 2:

name = input('Введите Ваше имя ')
age = input('Введите Ваш возраст ')
print('Будем знакомы! Ваше имя: ', name, ', Ваш возраст: ', age, 'лет.')


n = input('Давайте поиграем. Найдем сумму чисел: n+nn+nnn. Введите число n ')
a = n + n
b = n + n + n

print(n)
print(a)
print(b)

result = int(n) + int(a) + int(b)
print('n', '+', 'nn', '+', 'nnn', '=', result)

